Importancion de la base de datos

In [1]:
import pandas as pd
import numpy as np

In [15]:
df = pd.read_csv('airlines.csv')
df.head(10)

,Airline ID,Name,Alias,IATA,ICAO,Callsign,Country,Active
0,-1,Unknown,\N,-,NaN,\N,\N,Y
1,1,Private flight,\N,-,NaN,NaN,NaN,Y
2,2,135 Airways,\N,NaN,GNL,GENERAL,United States,N
3,3,1Time Airline,\N,1T,RNX,NEXTIME,South Africa,Y
4,4,2 Sqn No 1 Elementary Flying Training School,\N,NaN,WYT,NaN,United Kingdom,N
5,5,213 Flight Unit,\N,NaN,TFU,NaN,Russia,N
6,6,223 Flight Unit State Airline,\N,NaN,CHD,CHKALOVSK-AVIA,Russia,N
7,7,224th Flight Unit,\N,NaN,TTF,CARGO UNIT,Russia,N
8,8,247 Jet Ltd,\N,NaN,TWF,CLOUD RUNNER,United Kingdom,N
9,9,3D Aviation,\N,NaN,SEC,SECUREX,United States,N

Informacion General

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6162 entries, 0 to 6161
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Airline ID  6162 non-null   int64
 1   Name        6162 non-null   object
 2   Alias       5656 non-null   object
 3   IATA        1535 non-null   object
 4   ICAO        6075 non-null   object
 5   Callsign    5354 non-null   object
 6   Country     6147 non-null   object
 7   Active      6162 non-null   object
dtypes: int64(1), object(7)
memory usage: 385.3+ KB

In [17]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
Airline ID,6162.0,4152.723304,4507.307094,-1.0,1541.25,3082.5,4628.75,21317.0

Buscar valores nulos

In [18]:
df.isnull().sum()

Airline ID       0
Name             0
Alias          506
IATA          4627
ICAO            87
Callsign       808
Country         15
Active           0
dtype: int64

In [19]:
(df.isnull().sum() / len(df)) * 100

Airline ID     0.000000
Name           0.000000
Alias          8.211620
IATA          75.089257
ICAO           1.411879
Callsign      13.112626
Country        0.243427
Active         0.000000
dtype: float64

Eliminar duplicados

In [20]:
print("Duplicados Antes:", df.duplicated().sum())

df = df.drop_duplicates()

print("Duplicados Después:", df.duplicated().sum())

Duplicados Antes: 0
Duplicados Después: 0

Eliminar nulos

In [24]:
df = df.dropna()
df.isnull().sum()
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1010 entries, 3 to 6161
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Airline ID  1010 non-null   int64
 1   Name        1010 non-null   object
 2   Alias       1010 non-null   object
 3   IATA        1010 non-null   object
 4   ICAO        1010 non-null   object
 5   Callsign    1010 non-null   object
 6   Country     1010 non-null   object
 7   Active      1010 non-null   object
dtypes: int64(1), object(7)
memory usage: 71.0+ KB